#+TITLE: Module1week3
#+begin_quote
The goal of this assignment is to practice working with integers, slices and loops in Go.

Click on "My submission" above to see specific assignment directions and to submit your response.

Review criteria
less
This assignment is worth a total of 10 points:

3 points will be given if a program is written.

2 points will be given if the program compiles correctly.

A maximum of 3 points will be given for the first test execution, if the program correctly prints the sorted slice after entering three distinct integers. **Points are awarded incrementally each time that an integer is added and it correctly prints the sorted slice.

A maximum of 2 points will be given for the second test execution, if the program correctly prints the sorted slice after entering four distinct integers. **Points are awarded if it correctly prints the sorted slice after adding the fourth integer.
#+end_quote

#+begin_src go
package main

import (
	"fmt"
	"sort"
)

func main() {
	var sli []int
	sli = make([]int, 0,4)

	var input []int
	fmt.Scan(&input)

	for id, value := range input {
		sli[id] = value
	}

	sort.Ints(sli)
	fmt.Println(sli)
}
#+end_src

#+RESULTS:
: []
